app/controllers/circles_controller.rb

SELECT * FROM "circles"
---
  def index
    @circles = Circle.all

SELECT * FROM "circles" WHERE ("circles"."id" = 1)
---
  def show
    @circle = Circle.find(params[:id])

SELECT * FROM "circles" WHERE ("circles"."id" = 1)
---
  def edit
    @circle = Circle.find(params[:id])

INSERT INTO "circles" ("name", "created_at", "updated_at", "mail", "alias", "description") VALUES('サークルあいう', '2010-05-08 06:40:45', '2010-05-08 06:40:45', 'abc@gmail.com', 'aiu', '説明文です。説明文です。説明文です。説明文です。説明文です。説明文です。説明文です。説明文です。説明文です。説明文です。説明文です。説明文です。')
---
  def create
    @circle = Circle.new(params[:circle])

    respond_to do |format|
      if @circle.save

SELECT * FROM "circles" WHERE ("circles"."id" = 1)
UPDATE "circles" SET "image" = '02_LHR-A_01.JPG', "updated_at" = '2010-05-09 03:51:43' WHERE "id" = 1
---
  def update
    @circle = Circle.find(params[:id])

    respond_to do |format|
      if @circle.update_attributes(params[:circle])